# FormulaEditing Event (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UIApplication..::..FormulaEditing Event
UIApplication Class See Also
---
Subscribe to the FormulaEditing event to be notified when the edit formula button has been clicked.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public event EventHandler<FormulaEditingEventArgs> FormulaEditing
```

Visual Basic
---
```text
Public Event FormulaEditing As EventHandler(Of FormulaEditingEventArgs)
```

Visual C++
---
```text
public:
 event EventHandler<FormulaEditingEventArgs^>^ FormulaEditing {
	void add (EventHandler<FormulaEditingEventArgs^>^ value);
	void remove (EventHandler<FormulaEditingEventArgs^>^ value);
}
```

# See Also
UIApplication Class
Autodesk.Revit.UI Namespace